app/controllers/meters_controller.rb

  def index
  	# rest
  	# routes
    @meters = Meter.limit(30)
---
SELECT TOP (1) [Meter].* FROM [Meter]

  def list
    # wants is determined by the http Accept header in the request
    @meters = Meter.limit(10)
---
SELECT [Meter].* FROM [Meter]