app/controllers/meter_day_datas_controller.rb

SELECT [MeterDayData].* FROM [MeterDayData] WHERE (M_ID = N'5388' AND M_date BETWEEN '2012-07-25 00:00:00.000' AND '2012-08-01 00:00:00.000')
---
  def index
    if (params[:start_date].nil? == true && params[:end_date].nil? == true)
    	@meter_days_data = MeterDayData.search("#{params[:meter_id]}", "2012-07-26", "2012-08-02")